package codeMu.level3;

public class level30 {
    public static void main(String[] args) {
        //    №1 Дано целое число:
        //    int num = 10203304506;
        //    Выведите в консоль позиции всех цифр 0 в этом числе, за исключением первой и последней.

        //    №2 Дан массив с целыми числами:
        //    int arr1[] = {123, 334, 456, 556, 789};
        //    Запишите в новый массив числа, состоящие из разных цифр:
        //    int arr2[] = {123, 456, 789};

        //    №3 Дано дробное число:
        //    float num = 12.34;
        //    Запишите целую часть числа в одну переменную, а дробную часть - в другую:
        //    int num1 = 12;
        //    int num1 = 34;
    }
}
