package codeMu.level3;

public class level21 {
    public static void main(String[] args) {
        //    №1 Дан массив с целыми числами. Выведите в консоль только те числа, которые делятся на 5.

        //    №2 Дана строка:
        //    "abcdef"
        //    Получите первых три символа этой строки:
        //    "abc"

        //    №3 Дан символ:
        //    char chr = 'a';
        //    Узнайте, в каком регистре этот символ: в верхнем или нижнем.

        //    №4 Дан массив:
        //    int[] [1, 2, 3, 4, 5, 6]
        //    Получите из него следующий срез:
        //    int[] [1, 2, 3]

        //    №5 Дан массив с целыми числами:
        //    int[] arr = {1, 2, 3, 0, 4, 5};
        //    Выведите в консоль позицию первого нуля.

        //    №6 Дана строка:
        //    "123-456-789"
        //    Замените все дефисы на пробелы:
        //    "123 456 789"
    }
}
