package codeMu.level3;

public class level25 {
    public static void main(String[] args) {
    //    №1 Дан текст со словами. Запишите в массив все слова, начинающиеся на букву "a".

    //    №2 Дан массив со числами. Проверьте, что все элементы этого массива являются положительными числами.

    //    №3 Дана некоторая строка:
    //    "1203405"
    //    Найдите позицию последнего нуля в строке.

    //    №4 Даны два массива:
    //    int[] arr1 = [1, 2, 3, 4, 5];
    //    int[] arr2 = [4, 5, 6, 7, 8];
    //    Выведите в консоль общие элементы этих массивов:
    //    4
    //    5

    //    №5 Дана строка:
    //    String str = "abc def jhi";
    //    Подсчитайте количество слов в этой строке.
    }
}
