package codeMu.level3;

public class level28 {
    public static void main(String[] args) {
        //    №1 Дан массив с целыми числами. Проверьте, что все числа из этого массива содержат в себе цифру 3.

        //    №2 Дана некоторая строка:
        //    "12034050607"
        //    Найдите позицию третьего нуля в строке.

        //    №3 Через запятую написаны целые числа:
        //    String str = "1,2,10,100,3";
        //    Получите максимальное из этих чисел.

        //    №4 Дана строка:
        //    String str = "abcde";
        //    Получите массив символов этой строки:
        //    char[] {'a', 'b', 'c', 'd', 'e'}

        //    №5 Дана строка в формате:
        //    "kebab-case"
        //    Преобразуйте ее в формат:
        //    "snake_case"

        //    №6 Дана строка в формате:
        //    "snake_case"
        //    Преобразуйте ее в формат:
        //    "camelCase"

        //    №7 Дана строка в формате:
        //    "camelCase"
        //    Преобразуйте ее в формат:
        //    "snake_case"
    }
}
