package codeMu.level4;

public class level35 {
    public static void main(String[] args) {
    //    №1 Выведите в консоль все числа от 1 до 1000, сумма цифр которых равна 13.

    //    №2 Даны значения в пикселях, содержащие целые числа:
    //    String size1 = "12px";
    //    String size2 = "15px";
    //    Сложите эти значения так, чтобы результат также был в пикселях:
    //    "28px"

    //    №3 Дан массив:
    //    int[] {1, 2, 3}
    //    Создайте новый массив так, чтобы в нем каждый элемент первого массива повторился два раза:
    //    int[] {1, 1, 2, 2, 3, 3}

    //    №4 Дан массив:
    //    int[] arr = {1, 2, 3, 4, 5};
    //    Создайте новый массив так, чтобы в новом массиве были все элементы первого массива, за исключением N первых элементов.
    }
}
