package codeMu.level4;

public class level34 {
    public static void main(String[] args) {
        //    №1 Дана строка. Удалите из нее все гласные буквы.

        //    №2 Дано целое число. Проверьте, что у этого числа есть только один делитель, кроме него самого и единицы.

        //    №3 Напишите программу, которая сформирует следующую строку:
        //    "xxx xxx xxx"

        //    №4 Дан массив:
        //    int[] [1, 2, 3, 4, 5, 6]
        //    Получите из него каждый второй элемент:
        //    int[] [1, 3, 5]

        //    №5  Дан массив символов, содержащий цифры:
        //    chars[] {'1', '2', '3', '4', '5'};
        //    Слейте элементы этого массива в целое число:
        //    int 12345
    }
}
