package codeMu.level4;

public class level37 {
    public static void main(String[] args) {
    //    №1 Дан массив с целыми числами:
    //    int arr = [123, 456, 789];
    //    Проверьте, что в нем есть число, содержащее в себе цифру 3.

    //    №2 Дан массив со строками, содержащими целые числа в виде строк:
    //    String[] arr = ["1", "2", "3", "4", "5"];
    //    Найдите сумму элементов этого массива.

    //    №3 Дана некоторая строка:
    //    "AbCdE"
    //    Смените регистр букв этой строки на противоположный. В нашем случае должно получится следующее:
    //    "aBcDe"

    //    №4 Напишите программу, которая сформирует следующую строку:
    //    "-1-2-3-4-5-"

    //    №5 Дана дата в следующем формате:
    //    String date = "31-12-2025";
    //    Преобразуйте ее в следующий формат:
    //    String date = "31 декабря 2025";
    }
}
