package codeMu.level4;

public class level38 {
    public static void main(String[] args) {
        //№1 Дана строка с буквами:
        //String str = "Aaa Bbb Ccc';
        //Проверьте, что в этой строке не более двух заглавных букв.

        //№2 Дана дата в следующем формате:
        //String str = "2025-12-31';
        //Преобразуйте эту дату в следующий массив:
        //String[] {"31", "12", "2025"}

        //№3 Дана некоторая строка со словами:
        //"aaa bbb ccc"
        //Сделайте заглавным первый символ каждого слова в этой строке. В нашем случае должно получится следующее:
        //"Aaa Bbb Ccc"

        //№4 Дан массив символов:
        //char[] arr = {'a', 'b', 'c', 'd', 'e', 'f'};
        //Слейте эти символы попарно в виде строк:
        //String[] {"ab", "cd", "ef"}
    }
}
