package codeMu.level2;

public class level20 {
    public static void main(String[] args) {
        //    №1 Дана переменная, содержащая радиус шара:
        //    float r = 10.3;
        //    Получите объем и площадь поверхности этого шара.

        //    №2 Даны два целых числа:
        //    int num1 = 12;
        //    int num2 = 16;
        //    Выведите в консоль все общие делители этих чисел.

        //    №3 Дан массив с целыми числами:
        //    int[] {1, 2, 3, 4, 5};
        //    Поменяйте местами первый и последний элементы этого массива:
        //    int[] {5, 2, 3, 4, 1};

        //    №4 Дано число из 6-ти цифр
        //    int num = 123321;
        //    Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
    }
}
