package codeMu.level2;

public class level16 {
    public static void main(String[] args) {
        //        №1 Дан массив с числами:
        //        int[] arr = {-1, 2, -3, 4, 5, 11};
        //        Найдите сумму тех элементов этого массива, которые больше нуля и меньше десяти.
        //
        //№2 Дан массив с целыми числами:
        //        int[] arr = {1, 2, 3, 4, 5};
        //        Выведите в консоль элементы этого массива, которые являются четными числами.
        //
        //№3 Дан массив с целыми числами:
        //        int[] arr = {1, 2, 3, 0, 4, 5};
        //        Выведите в консоль элементы этого массива до первого нуля.
    }
}
