package codeMu.level2;

public class level19 {
    public static void main(String[] args) {
        // №1 С помощью цикла заполните массив четными числами из промежутка от 1 до 100.

        // №2 Дан массив с целыми числами:
        // int[] {1, 2, 3, 4, 5};
        // Поменяйте местами первый и второй элементы этого массива:
        // int[] {2, 1, 3, 4, 5};

        // №3 Дано целое число, содержащее номер дня недели от 1 до 7:
        // byte num = 1;
        // Определите, эта переменная содержит выходной или будний день.

        // №4 Дана переменная, содержащая температуру в градусах Цельсия:
        // short tc = 25;
        // Напишите программу, которая преобразует эту температуру в градусы Фарингейта.
    }
}
