package codeMu.level2;

public class level18 {
    public static void main(String[] args) {
        // №1 Дан массив со строками:
        // String[] arr = {"ab", "cd", "ef"};
        // Получите массив символов этих строк:
        // char[] {'a', 'b', 'c', 'd', 'e', 'f'}

        // №2 Дано целое число, содержащее номер месяца от 1 до 12:
        // byte num = 1;
        // Выведите название месяца, соответствующее этому числу.

        // №3 Дана строка:
        // String str = "12345";
        // Получите первый и последний символ этой строки в следующем виде:
        // String "15";

        // №4 Даны переменные, содержащие стороны прямоугольника:
        // int a = 10;
        // int b = 20;
        // Получите площадь и периметр этого прямоугольника.
    }
}
