package codeMu;

public class level11 {
    public static void main(String[] args) {
        // №1 Дан массив с целыми числами:
        // int[] arr = {1, 2, 3, 4, 5};
        // Выведите в консоль элементы этого массива.

        // №2 Дан массив со строками:
        // String[] arr = {"ab", "cd", "ef"};
        // Выведите в консоль первые символы элементов этого массива.

        //  №3 Дано некоторое целое число:
        // int num = 12345;
        // Найдите сумму всех его четных цифр.

        //  №4 Дано некоторое целое число:
        // byte num = 12;
        // Найдите факториал этого числа.
    }
}
