package codeMu;

public class level13 {
    public static void main(String[] args) {
//         №1
//
//        Дан массив с целыми числами:
//        int[] arr = {1, 2, 3, 4, 5};
//
//        Найдите сумму квадратов элементов этого массива.
//
//№2
//
//        Дан массив с целыми числами:
//        int[] arr = {1, 2, 3, 4, 5};
//
//        Найдите среднее арифметическое этого массива.
//
//№3
//
//        Дан массив:
//        int[10] arr;
//
//        С помощью цикла заполните этот массив целыми числами от 1 до 10.
    }
}
