package codeMu;

public class level14 {
    public static void main(String[] args) {
        //  №1 Дан массив с числами:
        // int[] arr = [1, 2, 3, 4, 5];
        // Найдите сумму квадратных корней элементов этого массива.

        // №2 Дан массив с числами:
        // int[] {1, 2, 3, 4};
        // Увеличьте каждый элемент этого массива в два раза:

        // int[] {2, 4, 9, 8};
        // №3 Дан массив:
        // int[10] arr;
        // С помощью цикла заполните этот массив целыми числами от 10 до 1.
    }
}
