package codeMu;

public class level12 {
    public static void main(String[] args) {
        // №1 Найдите среднее арифметическое всех целых чисел от 1 до 100.

        //№2  Дано число:
        // int num = 12345;
        // Найдите сумму первой и последней цифры этого числа.

        //№3 Дан массив с целыми числами:
        // int[] arr = {1, 2, 3, 4, 5};
        // Найдите сумму элементов этого массива.

        //№4 Дано некоторое целое число:
        // int num = 12345;
        // Выведите в консоль все его цифры с конца.
    }
}
