package codeMu.level5;

public class level41 {
    public static void main(String[] args) {
        //№1 Попросите у пользователя ввести через консоль два числа. Выведите сумму этих чисел.

        //№2 Дано число:
        //int num = 133;
        //Определите, есть ли среди цифр этого числа одинаковые.

        //№3 Дан массив:
        //int[][] arr = {
        //{1, 2, 3},
        //{4, 5, 6},
        //{7, 8, 9},
        //};
        //Выведите в консоль все элементы этого массива.

        //№4 Напишите программу, которая выведет в консоль следующую пирамидку:
        //x
        //xx
        //xxx
        //xxxx
        //xxxxx
    }
}
