package codeMu.level5;

public class level45 {
    public static void main(String[] args) {
        //№1 Попросите у пользователя ввести через консоль целое число из промежутка от 1 до 10. Если будет введено что-то другое, то попросите пользователя ввести число еще раз.

        //№2
        //Сформируйте с помощью циклов следующий массив:
        //int[] {
        //    {1, 2, 3},
        //    {1, 2, 3},
        //    {1, 2, 3},
        //    {1, 2, 3},
        //    {1, 2, 3},
        //}

        //№3 Дана некоторая строка:
        //"abcdeabc"
        //Очистите ее от дублей символов:
        //"abcde"

        //№4 Дана некоторая строка:
        //"abcde"
        //Переведите в верхний регистр все нечетные буквы этой строки. В нашем случае должно получится следующее:
        //"AbCdE"
    }
}
