package codeMu.level5;

public class level44 {
    public static void main(String[] args) {
        //№1 Дано некоторое целое число:
        //int num = 12345;
        //Проверьте, что цифры этого числа расположены по возрастанию.

        //№2 Дан некоторый массив:
        //int[] arr = {123, 456, 789};
        //Получите массив первых цифр входящих в первый массив чисел:
        //byte[] {1, 4, 7};

        //№3 Сформируйте с помощью циклов следующий массив:
        //char[] {
        //    {'x', 'x', 'x'},
        //    {'x', 'x', 'x'},
        //    {'x', 'x', 'x'},
        //}
    }
}
