package codeMu.level5;

public class level42 {
    public static void main(String[] args) {
        //№1 Попросите у пользователя ввести через консоль 10 чисел. Заполните массив этими числами.

        //№2 Дан массив:
        //int[][] arr = {
        //    {1, 2, 3},
        //    {4, 5, 6},
        //    {7, 8, 9},
        //};
        //Найдите сумму элементов этого массива.

        //№3 Дан массив с целыми числами:
        //int[] arr = {100, 200, 300, 400, 500};
        //Выведите в консоль элементы этого массива, первая цифра которых равна 1 или 2.

        //№4 Дан массив с целыми числами:
        //int arr = [123, 987, 345, 567];
        //Получите второй элемент, содержащий в себе цифру 3:
        //345

        //№5 Напишите программу, которая выведет в консоль следующую пирамидку:
        //1
        //22
        //333
        //4444
        //55555
    }
}
