package codeMu.level5;

public class level48 {
    //     №1
    //    Дан массив:
    //    {
    //        {2, 1, 4, 3, 5},
    //        {3, 5, 2, 4, 1},
    //        {4, 3, 1, 5, 2},
    //    }
    //    Отсортируйте элементы в каждом подмассиве.

    //№2
    //    Дан некоторый массив с числами, например, вот такой:
    //    int[] arr = [1, 2, 3, 4, 5, 6];
    //
    //    Слейте пары элементов вместе:
    //    int[] [12, 34, 56]

    // №3
    //    Выведите на экран следующую пирамидку:
    //    111
    //    222
    //    333
    //    444
    //    555
    //    666
    //    777
    //    888
    //    999
}
